Revit 2027 API
ParameterTypeId.MechanicalEquipmentSetOnDuty Property
 "On Duty"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId MechanicalEquipmentSetOnDuty { get; }
Public Shared ReadOnly Property MechanicalEquipmentSetOnDuty As ForgeTypeId
	Get
public:
static property ForgeTypeId^ MechanicalEquipmentSetOnDuty {
	ForgeTypeId^ get ();
}
static member MechanicalEquipmentSetOnDuty : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace